Revit 2027 API
Stairs.NumberOfStories Property
 The number of stories of a multi-story stair, or 1 for a single-story stair.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfStories { get; }
Public ReadOnly Property NumberOfStories As Integer
	Get
public:
property int NumberOfStories {
	int get ();
}
member NumberOfStories : int with get
Property Value
Int32
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace